Merge pull request #4 from benjigill/doc-fixes
